# Example

In [52]:
import pandas as pd
list1=[3,-5,7,4]
list2=['a','b','c','d']
series=pd.Series(list1,index=list2)
series

a    3
b   -5
c    7
d    4
dtype: int64

In [53]:
data_dict = {'Numbers': [1,2,3],
             'Countries': ['DE','FR','IT'],
             'Color': ['Blue','Red','Green']}
df = pd.DataFrame(data=data_dict) 
df

   Numbers Countries  Color
0        1        DE   Blue
1        2        FR    Red
2        3        IT  Green

In [54]:
import numpy as np
ndarray = np.array([(1,2,3),
                    (4,5,6),
                    (7,8,9)])
df2 = pd.DataFrame(ndarray, columns = ['a','b','c']) 
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## common manipulations
| Target | Command | Description 
| --- | --- | --- |
| adding column (opt.1) | `df['new_col1'] = list` | Adding list to existing DataFrame as a new column at the end | 
| adding column (opt.2) | `df.insert(2, 'new_col2', list) ` | Insert list to existing DataFrame as a new column at specific position |
| filter df | `df.filter()` | Select columns or rows by name, regex |
| filter df by column values (opt.1) | `df.query("Color == 'Blue'")` | Filter based on a query string |
| filter df by column values (opt.2) | `df[list_bool]` | Filter by a given list of Booleans, like list_bool = [True, False, True, ...] |
| drop column (opt.1) | `df.drop(columns=['col1', 'col2'])` | Drop column by giving list of column names |
| drop columns (opt.2) | `df.pop('col_name')` | Drop a column and return the dropped column |
| drop rows | `df.drop(index=[0,2])` | Drop rows based on list of index |
| drop NA | `df.dropna()` | Drop the rows where at least one element is missing |

In [55]:
# will change df!
new_col_list = ['Jan','Feb','Mar']
df['new_col1'] = new_col_list
df

   Numbers Countries  Color new_col1
0        1        DE   Blue      Jan
1        2        FR    Red      Feb
2        3        IT  Green      Mar

In [56]:
# will change df!
df.insert(2,'new_col_list2', new_col_list)
df

   Numbers Countries new_col_list2  Color new_col1
0        1        DE           Jan   Blue      Jan
1        2        FR           Feb    Red      Feb
2        3        IT           Mar  Green      Mar

In [57]:
# no impact on df, needs to be assigneed
df.filter(items=['Countries','Color'])

  Countries  Color
0        DE   Blue
1        FR    Red
2        IT  Green

In [58]:
# no impact on df, needs to be assigneed
df.filter(like='ne')

  new_col_list2 new_col1
0           Jan      Jan
1           Feb      Feb
2           Mar      Mar

In [59]:
# no impact on df, needs to be assigneed
df.filter([0,2],axis=0)

   Numbers Countries new_col_list2  Color new_col1
0        1        DE           Jan   Blue      Jan
2        3        IT           Mar  Green      Mar

In [60]:
# no impact on df, needs to be assigneed
df.drop(columns=['new_col_list2'])

   Numbers Countries  Color new_col1
0        1        DE   Blue      Jan
1        2        FR    Red      Feb
2        3        IT  Green      Mar

In [61]:
# will change df!
df.pop('new_col_list2')

0    Jan
1    Feb
2    Mar
Name: new_col_list2, dtype: object

In [62]:
df.drop(index=2)

   Numbers Countries Color new_col1
0        1        DE  Blue      Jan
1        2        FR   Red      Feb